app/controllers/tweets_controller.rb

SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (3)
---
  def index
    @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('yagiyagi', '', 'fight', 3, '2016-09-27 06:45:29', '2016-09-27 06:45:29')
---
  def create
      Tweet.create(image: tweet_params[:image], text: tweet_params[:text],user_id: current_user.id)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 12
---
  def destroy
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.destroy

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 10 LIMIT 1
---
  def edit
    @tweet = Tweet.find(params[:id])

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 10 LIMIT 1
UPDATE `tweets` SET `text` = 'fight!!', `updated_at` = '2016-09-27 09:44:20' WHERE `tweets`.`id` = 10
---
  def update
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.update(tweet_params)

SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 10 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 10
---
  def show
    @tweet = Tweet.find(params[:id])
    @comments = @tweet.comments.includes(:user)